---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs
source: html/5ab9f2a3-ea9c-aa8a-2d5c-a90737e097bd.htm
---
# DialogBoxShowingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.